content/posts/Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017.md
+++
title = "Master equations and the theory of stochastic path integrals by Markus Weber and Erwin Frey in 2017"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:15-04:00
slug = "Master_equations_and_the_theory_of_stochastic_path_integrals_by_Markus_Weber_and_Erwin_Frey_in_2017"
draft = false
+++

## [papers]({{< relref "papers" >}}), [stochastic processes]({{< relref "stochastic_processes" >}}), [statistical physics]({{< relref "statistical_physics" >}}), [Erwin Frey]({{< relref "Erwin_Frey" >}}) {#papers--papers-dot-md--stochastic-processes--stochastic-processes-dot-md--statistical-physics--statistical-physics-dot-md--erwin-frey--erwin-frey-dot-md}


## 1. Introduction {#1-dot-introduction}


### 1.1 Scope of this review {#1-dot-1-scope-of-this-review}


### 1.2 Organization of this review {#1-dot-2-organization-of-this-review}


### 1.3 Continuous-time Markov processes and the forward and backward master equations {#1-dot-3-continuous-time-markov-processes-and-the-forward-and-backward-master-equations}


### 1.4 Analytical and numerical methods for the solution of master equations {#1-dot-4-analytical-and-numerical-methods-for-the-solution-of-master-equations}


### 1.5 History of stochastic path integrals {#1-dot-5-history-of-stochastic-path-integrals}


### 1.6 Resume {#1-dot-6-resume}


## 2. The probability generating function {#2-dot-the-probability-generating-function}


### 2.1 Flow of the generating function {#2-dot-1-flow-of-the-generating-function}


### 2.2 Bases for particular stochastic processes {#2-dot-2-bases-for-particular-stochastic-processes}

<!--list-separator-->

-  2.2.2 Random walks

<!--list-separator-->

-  2.2.2 Chemical reactions

<!--list-separator-->

-  2.2.3 Intermezzo: the unit vector basis

<!--list-separator-->

-  2.2.4 Processes with locally excluding particles


### 2.3 Methods for the analysis of the generating function's flow equation {#2-dot-3-methods-for-the-analysis-of-the-generating-function-s-flow-equation}

<!--list-separator-->

-  2.3.1 A spectral method for the computation of stationary distributions

<!--list-separator-->

-  2.3.2 WKB approximations and related approaches

<!--list-separator-->

-  2.3.3 A variational method


### 2.4 Resume {#2-dot-4-resume}


## 3. The marginalized distribution and the probability generating functional {#3-dot-the-marginalized-distribution-and-the-probability-generating-functional}


### 3.1 Flow of the marginalized distribution {#3-dot-1-flow-of-the-marginalized-distribution}


### 3.2 Bases for particular stochastic processes {#3-dot-2-bases-for-particular-stochastic-processes}

<!--list-separator-->

-  3.2.1 Random walks

<!--list-separator-->

-  3.2.2 Chemical reactions


### 3.3 Mean extinction times {#3-dot-3-mean-extinction-times}


### 3.4 Flow of the generating functional {#3-dot-4-flow-of-the-generating-functional}


### 3.5 The Poisson representation {#3-dot-5-the-poisson-representation}


### 3.6 Resume {#3-dot-6-resume}


## 4. The backward path integral representation {#4-dot-the-backward-path-integral-representation}


### 4.1 Derivation {#4-dot-1-derivation}


### 4.2 Simple growth and linear decay {#4-dot-2-simple-growth-and-linear-decay}


### 4.3 Feynman-Kac formula for jump processes {#4-dot-3-feynman-kac-formula-for-jump-processes}


### 4.4 Intermezzo: the backward Kramers-Moyal expansion {#4-dot-4-intermezzo-the-backward-kramers-moyal-expansion}

<!--list-separator-->

-  4.4.1 Processes with continuous state spaces

<!--list-separator-->

-  4.4.2 Path integral representation of the backward Kramers-Moyal expansion

<!--list-separator-->

-  4.4.3 Path integral representation of the backward Fokker-Planck equation

<!--list-separator-->

-  4.4.4 The Onsager-Machlup function

<!--list-separator-->

-  4.4.5 Alternative discretization schemes

<!--list-separator-->

-  4.4.6 Wiener's path integral


### 4.5 Further exact solutions and perturbation expansions {#4-dot-5-further-exact-solutions-and-perturbation-expansions}

<!--list-separator-->

-  4.5.1 Pair generation

<!--list-separator-->

-  4.5.2 Diffusion on networks

<!--list-separator-->

-  4.5.3 Diffusion in continuous space

<!--list-separator-->

-  4.5.4 Diffusion and decay


### 4.6 Resume {#4-dot-6-resume}


## 5. The forward path integral representation {#5-dot-the-forward-path-integral-representation}


### 5.1 Derivation {#5-dot-1-derivation}


### 5.2 Linear processes {#5-dot-2-linear-processes}


### 5.3 Intermezzo: The forward Kramers-Moyal expansion {#5-dot-3-intermezzo-the-forward-kramers-moyal-expansion}


### 5.4 Resume {#5-dot-4-resume}


## 6. Path integral representation of averaged observables {#6-dot-path-integral-representation-of-averaged-observables}


### 6.1 Derivation {#6-dot-1-derivation}


### 6.2 Intermezzo: Alternative derivation based on coherent states {#6-dot-2-intermezzo-alternative-derivation-based-on-coherent-states}


### 6.3 Perturbation expansions {#6-dot-3-perturbation-expansions}


### 6.4 Coagulation {#6-dot-4-coagulation}


### 6.5 Resume {#6-dot-5-resume}


## 7. Stationary paths {#7-dot-stationary-paths}


### 7.1 Forward path integral approach {#7-dot-1-forward-path-integral-approach}


### 7.2 Binary annihilation {#7-dot-2-binary-annihilation}


### 7.3 Backward path integral approach {#7-dot-3-backward-path-integral-approach}


### 7.4 Binary annihilation {#7-dot-4-binary-annihilation}

<!--list-separator-->

-  7.4.1 Leading order

<!--list-separator-->

-  7.4.2 Beyond leading order


### 7.5 Resume {#7-dot-5-resume}


## 8. Summary and outlook {#8-dot-summary-and-outlook}


## Appendices {#appendices}


### A. Proof of the Feynman-Kac formula in 1.3 {#a-dot-proof-of-the-feynman-kac-formula-in-1-dot-3}


### B. Proof of the path summation representation in 1.4 {#b-dot-proof-of-the-path-summation-representation-in-1-dot-4}


### C. Solution of the random walk in 2.2.1 and 3.2.1 {#c-dot-solution-of-the-random-walk-in-2-dot-2-dot-1-and-3-dot-2-dot-1}


### D. Details on the evaluation of the backward path integral representation in 4.3 {#d-dot-details-on-the-evaluation-of-the-backward-path-integral-representation-in-4-dot-3}
